# ДЗ 15. Ромб 1

# При помощи вложенных циклов (можно while, можно for) и оператора IF нарисовать фигуры представленные ниже.
# Пользователь вводит, с клавиатуры, высоту фигуры в символах.
#
#   C         *
#           * * *
#         * * * * *
#       * * * * * * *
#     * * * * * * * * *
#   * * * * * * * * * * *
# * * * * * * * * * * * * *
#   *                   *
#     *               *
#       *           *
#         *       *
#           *   *
#             *

rows = 13
cols = 13
for i in range(rows):
    print(i, end='\t')
    for j in range(cols):
        if i == rows // 2 or j == cols // 2+2:
            print(' *', end='')
        else:
            print(' @', end='')
    print()
print()

